// Keyboard HID (handsfree) panel
"MSG_TYPE_PASSKEY" = "Syötä seuraava pääsykoodi ja paina näppäimistön rivinvaihtonäppäintä.";

"MSG_PAIRING_TIMEOUT" = "Parin muodostaminen kohteen ”%@.” kanssa epäonnistui. Yritä uudelleen osoittamalla Muodosta pari.";
"MSG_PAIRING_TIMEOUT_AUTO" = "Parin muodostaminen kohteen ”%@.” kanssa epäonnistui. Yritän seuraavan näppäimistön kanssa 5 sekunnin kuluttua.";
"MSG_PAIRING_TIMEOUT_AUTO_LAST" = "Parin muodostaminen kohteen ”%@.” kanssa epäonnistui. Yritän uudelleen 5 sekunnin kuluttua.";

"MSG_PAIRING_FAILED" = "Parin muodostaminen näppäimistön kanssa epäonnistui. Yritä uudelleen osoittamalla Muodosta pari.";
"MSG_PAIRING_FAILED_AUTO" = "Parin muodostaminen näppäimistön kanssa epäonnistui. Yritetään uudelleen…";

// Discovery Panel (General)
"kDiscovery_Gen_ErrorOccurredSearchingKey" = "Ongelma etsittäessä langattomia laitteita.";


//getPairingWithDeviceTitle;
"TITLE_PAIRING_WITH_YOUR_KEYBOARD" = "Muodostetaan paria näppäimistön ”%@.” kanssa";
"TITLE_PAIRING_WITH_YOUR_MOUSE" = "Muodostetaan paria hiiren ”%@.” kanssa";

//getSearchingForDeviceTitle;
"TITLE_SEARCHING_FOR_YOUR_KEYBOARD" = "Etsitään näppäimistöä…";
"TITLE_SEARCHING_FOR_YOUR_MOUSE" = "Etsitään hiirtä…";

//getDevicePairedTitle
"TITLE_PAIRED_KEYBOARD" = "Tietokoneesi on muodostanut parin kohteen ”%@” kanssa.";
"TITLE_PAIRED_MOUSE" = "Tietokoneesi on muodostanut parin kohteen ”%@” kanssa";

//getNFoundTitle
"TITLE_KEYBOARD_N_FOUND" = "Käyttöönottoapuri löysi %d langatonta näppäimistöä.";
"TITLE_MOUSE_N_FOUND" = "Käyttöönottoapuri löysi %d langatonta hiirtä.";

//getFoundTitle
"TITLE_KEYBOARD_FOUND" = "Käyttöönottoapuri löysi näppäimistön nimeltä ”%@.”";
"TITLE_MOUSE_FOUND" = "Käyttöönottoapuri löysi hiiren nimeltä ”%@.”";

//getMessageStartPairing
"MSG_START_PAIRING_KEYBOARD" = "Valitse näppäimistösi luettelosta ja osoita Muodosta pari. Kun näppäimistön kanssa on muodostettu pari, näet pääsykoodin, joka syötetään näppäimistöllä.";
"MSG_START_PAIRING_MOUSE" = "Käyttöönottoapuri yrittää parinmuodostusta jokaisen luettelossa olevan hiiren kanssa. Kun pari on muodostettu, voit liikuttaa osoitinta hiiren avulla.";

//getMessageStartPairingSingle
"MSG_START_PAIRING_KEYBOARD_SINGLE" = "Parinmuodostus näppäimistön ”%@” kanssa alkaa automaattisesti. Kun näppäimistön kanssa on muodostettu pari, näet pääsykoodin, jonka syötät näppäimistöllä.";
"MSG_START_PAIRING_MOUSE_SINGLE" = "Parinmuodostus hiiren ”%@” kanssa alkaa automaattisesti. Kun hiiren kanssa on muodostettu pari, voit siirtää osoitinta hiiren avulla.";

//getMessageDeviceNotFound
"MSG_KEYBOARDS_NOT_FOUND_SO_FAR" = "Näppäimistöä ei löytynyt. Etsitään…";
"MSG_MOUSE_NOT_FOUND_SO_FAR" = "Hiirtä ei löytynyt. Etsitään…";

//getMessageNoDevice
"MSG_NO_KEYBOARD" = "Tietokoneeseen ei ole kytketty näppäimistöä. Kytke näppäimistö nyt.";
"MSG_NO_MOUSE" = "Tietokoneeseen ei ole kytketty hiirtä. Kytke hiiri nyt.";

//getMessageNoDeviceBT
"MSG_NO_KEYBOARD_BLUETOOTH"	= "Tietokoneeseen ei ole kytketty näppäimistöä. Kytke näppäimistö nyt.\n\nJos käytössäsi on Applen langaton näppäimistö, varmista, että paristot on asetettu oikein ja näppäimistö on päällä.";
"MSG_NO_MOUSE_BLUETOOTH" = "Tietokoneeseen ei ole kytketty hiirtä. Kytke hiiri nyt.\n\nJos käytössäsi on Applen langaton hiiri, etsi hiiren pohjassa oleva kytkin ja laita se päälle vetämällä suojaa, kunnes LED on näkyvissä.\n\nJos et käytä hiirtä, kytke näppäimistö nyt.";

//getMessageGettingDeviceName
"MSG_GETTING_KEYBOARD_NAMES" = "Päivitetään %d näppäimistön nimiä...";
"MSG_GETTING_MOUSE_NAMES" = "Päivitetään %d hiiren nimiä...";

//getMessageWaitingForAcknowlegement
"MSG_WAITING_FOR_KEYBOARD_ACKNOWLEGEMENT" = "Hyväksy parinmuodostus painamalla näppäimistön rivinvaihtonäppäintä. Jos et tee niin, parinmuodostus alkaa uudelleen %d sekunnin kuluttua.";
"MSG_WAITING_FOR_MOUSE_ACKNOWLEGEMENT" = "Hyväksy parinmuodostus osoittamalla alla olevaa OK-painiketta hiiren avulla. Jos et tee niin, parinmuodostus alkaa uudelleen %d sekunnin kuluttua.";

//getMessageAuthenticationFailure
"MSG_AUTH_FAILURE_KEYBOARD" = "Syöttämäsi pääsykoodi ei kelpaa. Yritä uudelleen osoittamalla Muodosta pari.";
"MSG_AUTH_FAILURE_MOUSE" = "Parinmuodostus hiiren kanssa epäonnistui. Yritä uudelleen osoittamalla Muodosta pari.";

//getMessageAuthenticationFailureAuto
"MSG_AUTH_FAILURE_KEYBOARD_AUTO" = "Syöttämäsi pääsykoodi ei kelpaa. Yritetään parin muodostusta näppäimistön kanssa uudelleen 5 sekunnin kuluttua.";
"MSG_AUTH_FAILURE_MOUSE_AUTO" = "Parinmuodostus hiiren kanssa epäonnistui. Yritetään uudelleen viiden sekunnin kuluttua.";

//getMessageAlreadyPaired
"MSG_ALREADY_PAIRED_KEYBOARD" = "Odotetaan näppäimistön yhdistämistä…";
"MSG_ALREADY_PAIRED_MOUSE" = "Aloita hiiren käyttäminen osoittamalla sillä.";

// ** WARNINGS **
//getWarningPairingSingle
"MSG_WARNING_PAIRING_MOUSE_SINGLE" = "Jos tämä ei ole hiiresi, varmista, että hiiresi on päällä ja odota kunnes etsiminen alkaa uudelleen.";
"MSG_WARNING_PAIRING_KEYBOARD_SINGLE" = "Jos tämä ei ole näppäimistösi, varmista, että näppäimistösi on päällä ja odota kunnes etsiminen alkaa uudelleen.";

//getWarningPairing 
"MSG_WARNING_PAIRING_MOUSE" = "Jos hiiri ei ole luettelossa, varmista, että se on päällä ja odota, kunnes etsiminen alkaa uudelleen.";
"MSG_WARNING_PAIRING_KEYBOARD" = "Jos näppäimistö ei ole luettelossa, varmista, että se on päällä ja etsi uudelleen osoittamalla Kumoa.";

//getWarningAcknowlegement
"MSG_WARNING_ACK_MOUSE" = "Jos osoittimen siirtäminen hiiren avulla ei toimi, hiiri ei ole muodostanut paria tietokoneen kanssa. Odota kunnes parin muodostus alkaa uudelleen.";
"MSG_WARNING_ACK_KEYBOARD" = "Jos rivinvaihtonäppäimen painaminen ei vahvista parinmuodostusta, näppäimistö ei ole muodostanut paria tietokoneen kanssa. Odota kunnes parin muodostus alkaa uudelleen.";

// ** PAIRING STATUS **
//getMessagePairingStarting
"MSG_PAIRING_STARTING" = "Muodostetaan paria laitteesi kanssa...";

//getMessagePairingConnectingToDevice
"MSG_PAIRING_CONNECTING" = "Yhdistetään…";

//getMessagePairingConnectionEstablished
"MSG_PAIRING_CONNECTION_ESTABLISHED" = "Yhteydessä.";

//getMessagePairingConnectionComplete
"MSG_PAIRING_COMPLETE" = "Parin muodostus on valmis.";

"CUSTOM_MOUSE_NAME"	= "Hiiri (%@)";
"CUSTOM_KEYBOARD_NAME"	= "Näppäimistö (%@)";

